Autodesk.Revit.DB.WorksetTable.IsWorksetNameUnique(Autodesk.Revit.DB.Document,System.String)
Checks if the given workset name is unique in the document.
aDoc:
The document in which the workset is accessed.
name:
The workset name.
Returns:
True if this given workset name is unique in the document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.RenameWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,System.String)
Renames the workset.
aDoc:
The document in which the workset is accessed.
worksetId:
The workset Id.
name:
The workset name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDoc is not a workshared document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given workset name is already in use.
-or-
There is no workset in the document with this id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.DeleteWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.DeleteWorksetSettings)
Delete the specific workset.
Remarks:
Please checkout the workset before executing this method.
The method may fail in some situations that mentioned in Autodesk.Revit.DB.WorksetTable.CanDeleteWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.DeleteWorksetSettings).
Another failure case is the Transaction failure due to "Deleting all open views in a project is not allowed."
document:
The document containing the worksets.
worksetId:
The id of the workset to delete.
deleteWorksetSettings:
The settings to delete a workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
There is no workset in the document with this id.
-or-
Workset cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The document regeneration fails during the DeleteWorkset operation.
Since:
2022.1

Autodesk.Revit.DB.WorksetTable.CanDeleteWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.DeleteWorksetSettings)
Indicates if a workset can be deleted.
Remarks:
The workset can't be deleted in the following cases:
The input worksetId is not valid in the document.  The input worksetId doesn't represent a user-created workset, which means this workset might be a system workset.  The workset is not editable by the current user. In order to resolve this problem,
please checkout the workset by calling Autodesk::Revit::DB::WorksharingUtils::CheckoutWorksets.  The workset or some elements under the workset are owned by the other users. In order to resolve this problem,
please ask the other users to call Autodesk::Revit::DB::WorksharingUtils::RelinquishOwnership
to relinquish their ownership on the workset and elements.  The target workset is not a user-created workset.
document:
The document containing the worksets.
worksetId:
The id of the workset to delete.
deleteWorksetSettings:
The settings to delete a workset.
Returns:
True if the workset can be deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022.1

Autodesk.Revit.DB.WorksetTable.SetActiveWorksetId(Autodesk.Revit.DB.WorksetId)
Sets the active workset.
worksetId:
The workset Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset in the document with this id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.GetWorkset(Autodesk.Revit.DB.WorksetId)
Returns the workset from a input WorksetId.
id:
Id of a workset.
Returns:
The returned workset. null if there is no workset in this table with this Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012